[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "category_id": "01",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 488,
    "title": "HTML-5 Tutorials",
    "author": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://cdn-icons-png.flaticon.com/512/888/888859.png"
    },
    "thumbnail_url": "https://cdn-icons-png.flaticon.com/512/888/888859.png",
    "image_url": "https://cdn-icons-png.flaticon.com/512/888/888859.png",
    "details": "HTML5 is a markup language used for structuring and presenting content on the World Wide Web. It is the fifth and final major HTML version that is a World Wide Web Consortium (W3C) recommendation. The current specification is known as the HTML Living Standard. It is maintained by the Web Hypertext Application Technology Working Group (WHATWG), a consortium of the major browser vendors (Apple, Google, Mozilla, and Microsoft). HTML5 was first released in a public-facing form on 22 January 2008, with a major update and W3C Recommendation status in October 2014. Its goals were to improve the language with support for the latest multimedia and other new features; to keep the language both easily readable by humans and consistently understood by computers and devices such as web browsers, parsers, etc., without XHTML's rigidity; and to remain backward-compatible with older software. HTML5 is intended to subsume not only HTML 4 but also XHTML 1 and DOM Level 2 HTML. HTML5 includes detailed processing models to encourage more interoperable implementations; it extends, improves, and rationalizes the markup available for documents and introduces markup and application programming interfaces (APIs) for complex web applications. For the same reasons, HTML5 is also a candidate for cross-platform mobile applications because it includes features designed with low-powered devices in mind. Many new syntactic features are included. To natively include and handle multimedia and graphical content, the new <video>, <audio> and <canvas> elements were added, expandable sections are natively implemented through <summary>...</summary> and <details>...</details> rather than depending on CSS or JavaScript, and support for scalable vector graphics (SVG) content and MathML for mathematical formulas was also added. To enrich the semantic content of documents, new page structure elements such as <main>, <section>, <article>, <header>, <footer>, <aside>, <nav>, and <figure> are added. New attributes were introduced, some elements and attributes were removed, and others such as <a>, <cite>, and <menu> were changed, redefined, or standardized. The APIs and Document Object Model (DOM) are now fundamental parts of the HTML5 specification, and HTML5 also better defines the processing for any invalid documents."
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "category_id": "03",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 488,
    "title": "Bootstrap-3 Turtorial",
    "author": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png"
    },
    "thumbnail_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "image_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "details": "Bootstrap 3 is the most stable version of Bootstrap, and it is still supported by the team for critical bugfixes and documentation changes. Bootstrap is the most popular HTML, CSS, and JavaScript framework for developing responsive, mobile-first websites.  Bootstrap is completely free to download and use!"
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71011",
    "category_id": "06",
    "rating": {
      "number": 4.8,
      "badge": "Excellent"
    },
    "total_view": 400,
    "title": "React JS Tutorial",
    "author": {
      "name": "Jennifer Wood",
      "published_date": "2022-08-30 16:38:45",
      "img": "https://www.datocms-assets.com/45470/1631110818-logo-react-js.png"
    },
    "thumbnail_url": "https://www.datocms-assets.com/45470/1631110818-logo-react-js.png",
    "image_url": "https://www.datocms-assets.com/45470/1631110818-logo-react-js.png",
    "details": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies. React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with state management and rendering that state to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality"
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f9",
    "category_id": "03",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 980,
    "title": "Bootstrap-4 Turtorial",
    "author": {
      "name": "system",
      "published_date": "2022-08-24 23:15:00",
      "img": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png"
    },
    "thumbnail_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "image_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "details": "Bootstrap 4 is a newer version of Bootstrap, which is the most popular HTML, CSS, and JavaScript framework for developing responsive, mobile-first websites.  Bootstrap 4 is completely free to download and use! What is Bootstrap?      Bootstrap is a free front-end framework for faster and easier web development     Bootstrap includes HTML and CSS based design templates for typography, forms, buttons, tables, navigation, modals, image carousels and many other, as well as optional JavaScript plugins Bootstrap also gives you the ability to easily create responsive designs "
  },
  {
    "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
    "category_id": "04",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 733,
    "title": "Tailwind CSS Tutorial",
    "author": {
      "name": "Theo Minh Châu",
      "published_date": "2022-08-25 06:03:00",
      "img": "https://res.cloudinary.com/arcjet-media/image/upload/v1608734952/z8hzeszc9eb3sp3vp3qc.jpg"
    },
    "thumbnail_url": "https://res.cloudinary.com/arcjet-media/image/upload/v1608734952/z8hzeszc9eb3sp3vp3qc.jpg",
    "image_url": "https://res.cloudinary.com/arcjet-media/image/upload/v1608734952/z8hzeszc9eb3sp3vp3qc.jpg",
    "details": "Tailwind CSS is an open source CSS framework. The main feature of this library is that, unlike other CSS frameworks like Bootstrap, it does not provide a series of predefined classes for elements such as buttons or tables. Instead, it creates a list of utility CSS classes that can be used to style each element by mixing and matching. For example, in other traditional systems, there would be a class message-warning that would apply a yellow background color and bold text. To achieve this result in Tailwind, one would have to apply a set of classes created by the library: bg-yellow-200 and font-bold.  As of December 2022, Tailwind CSS has over 62,000 stars on GitHub."
  },
  {
    "_id": "f06f8cc035b04bd1158e4198281915a3",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "05",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 127,
    "title": "JavaScript Tutorial",
    "author": {
      "name": "Ukrainska Pravda",
      "published_date": "2022-08-25 18:53:49",
      "img": "https://www.computerhope.com/jargon/j/javascript.png"
    },
    "thumbnail_url": "https://www.computerhope.com/jargon/j/javascript.png",
    "image_url": "https://www.computerhope.com/jargon/j/javascript.png",
    "details": "JavaScript is the world's most popular programming language.  JavaScript is the programming language of the Web.  JavaScript is easy to learn.  This tutorial will teach you JavaScript from basic to advanced. JavaScript Can Change HTML Content  One of many JavaScript HTML methods is getElementById().  The example below finds an HTML element (with id=demo), and changes the element content (innerHTML) to Hello JavaScript"
  },
  {
    "_id": "4e6092d54c18fbd89ad59e88a1e87fbb",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "07",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 300,
    "title": "Node JS Tutorial",
    "author": {
      "name": "Joe Klark",
      "published_date": "2022-08-24 22:30:00",
      "img": "https://nodejs.org/static/images/logo-hexagon-card.png"
    },
    "thumbnail_url": "https://nodejs.org/static/images/logo-hexagon-card.png",
    "image_url": "https://nodejs.org/static/images/logo-hexagon-card.png",
    "details": "Node.js is an open-source server environment. Node.js is cross-platform and runs on Windows, Linux, Unix, and macOS. Node.js is a back-end JavaScript runtime environment. Node.js runs on the V8 JavaScript Engine and executes JavaScript code outside a web browser. Node.js lets developers use JavaScript to write command line tools and for server-side scripting. The functionality of running scripts server-side produces dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js represents a JavaScript everywhere paradigm, unifying web-application development around a single programming language, rather than different languages for server-side and client-side scripts"
  },
  {
    "_id": "acb9b6785b62698fc6130db7615965e1",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "03",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 879,
    "title": "Bootstrap-5 Turtorial",
    "author": {
      "name": "RTTNews",
      "published_date": "2022-08-25 11:53:13",
      "img": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png"
    },
    "thumbnail_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "image_url": "https://static.javatpoint.com/bootstrappages/images/bootstrap-tutorial.png",
    "details": "Bootstrap is a powerful front-end framework for faster and easier web development. It includes HTML and CSS based design templates for creating common user interface components like forms, buttons, navigations, dropdowns, alerts, modals, tabs, accordions, carousels, tooltips, and so on. Bootstrap gives you ability to create flexible and responsive web layouts with much less efforts. Bootstrap was originally created by a designer and a developer at Twitter in mid-2010. Before being an open-sourced framework, Bootstrap was known as Twitter Blueprint."
  },
  {
    "_id": "1b03149c50f1bec662062d930bf46489",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",
    "rating": {
      "number": 4.5,
      "badge": "Excellent"
    },
    "total_view": 546,
    "title": "Vanila CSS Tutorial",
    "author": {
      "name": "The Philadelphia Inquirer",
      "published_date": "2022-08-30 22:00:00",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYoObrmCsyjTvvq9SY6Cx9LRgqPA0OoQfhpOa_Kqcv_GIco_wIEs0SelofH6dt7Hkxub4&usqp=CAU"
    },
    "thumbnail_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYoObrmCsyjTvvq9SY6Cx9LRgqPA0OoQfhpOa_Kqcv_GIco_wIEs0SelofH6dt7Hkxub4&usqp=CAU",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRYoObrmCsyjTvvq9SY6Cx9LRgqPA0OoQfhpOa_Kqcv_GIco_wIEs0SelofH6dt7Hkxub4&usqp=CAU",
    "details": "CSS is the language we use to style an HTML document.  CSS describes how HTML elements should be displayed.  This tutorial will teach you CSS from basic to advanced. What is CSS? CSS stands for Cascading Style Sheets     CSS describes how HTML elements are to be displayed on screen, paper, or in other media     CSS saves a lot of work. It can control the layout of multiple web pages all at once     External stylesheets are stored in CSS files "
  }
]